/**
 * 2020.10.16
 * 作者 絕版大叔、
 * QQ   250740270
 *
 * 用于提取过滤器中的配色
 *  并生成一个由 颜色数组对象 组成的 json
 * [
 *  {
        "name": "0 Color",
        "hex": "#a96216"
    },
    .....
 * ]
 */

//  一下数据为手动正则提取
const s = `
169 98 22
169 98 22
0 0 0
0 0 0
33 184 255
0 0 0
0 0 0
33 184 255
0 0 0
0 0 0
58 255 255
0 0 0
0 0 0
58 255 255
0 0 0
0 0 0
58 255 255
0 0 0
0 0 0
58 255 255
0 0 0
0 0 0
255 91 209
0 0 0
0 0 0
235 205 0
0 0 0
0 0 0
205 223 77
0 0 0
0 0 0
205 223 77
0 0 0
33 184 255
0 0 0
255 255 255
255 255 255
255 255 255
255 255 255
255 255 255
120 96 249
120 96 249
0 0 0
0 0 0
255 255 255
175 96 37
255 0 0
255 0 0
255 0 0
255 0 0
255 57 43
255 57 43
0 0 0
255 255 0
255 255 0
0 0 0
255 205 0
255 205 0
8 8 8
235 205 0
235 205 0
0 0 0
255 255 255
120 96 249
0 0 0
  `.trim().split("\n") //前后删除空白符 分割字符串

// 去重复
const ss = new Set(s);

let i = 0
const hex = ([...ss]).map((v) => {
    // 把每个rgb颜色元素分割后转为十六进制 不足两位数向前补零 最后合并rgb为一个整体
    const hexColors = v.split(" ").map((v) => Number(v).toString(16).padStart(2, 0)).reduce((a, b) => a + b)
    return { "name": i++ + " Color", "hex": "#" + hexColors }
})


console.log(JSON.stringify(hex))
